Revit 2027 API
SpacingRule.HasBeltMeasurement Property
 True if the gridlines are not parallel due to surface curvature, and the BeltMeasurement property therefore applies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasBeltMeasurement { get; }
Public ReadOnly Property HasBeltMeasurement As Boolean
	Get
public:
property bool HasBeltMeasurement {
	bool get ();
}
member HasBeltMeasurement : bool with get
Property Value
Boolean
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace